backend/modules/columiest/models/Post.php

  public function fields()
{
    return [
        // field name is the same as the attribute name
        'newsid' => 'id',
        // field name is "email", the corresponding attribute name is "email_address"
        'slug',
        // field name is "name", its value is defined by a PHP callback
        'title',
        'categories' => function ($model) {
            $cat = $model->catValues;
            $cat = str_replace('[', '', $cat);
            $cat = str_replace(']', '', $cat);

            return $cat;
        },
        'image' => function ($model) {
            return $model->thumbnail;
        },
        'epaper_image' => function ($model) {
            $post_id = $model->id;
            $image_url = '';

            $post_map = \backend\modules\paper\models\TblMapPost::find()->where(['post_id' => $post_id])->one();
---
SELECT * FROM `tbl_map_post` WHERE `post_id`=39741