common/models/TblAccount.php

SELECT * FROM `tbl_account` WHERE `id`=2
---
    public static function findIdentity($id)
    {
        return self::findOne(['id' => $id]);

SELECT * FROM `tbl_account` WHERE `auth_key`='zNAQdl3m4pxjh_rUqNCbH5zR4YA0Z2XD'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return self::findOne(['auth_key' => $token]);