api/modules/v1/controllers/EpaperController.php

            $epaper_data[$issue_date][$station_name]['status']              = $status;

            foreach ($pageDetail as $key => $value) {
                $page_detail = TblPapEpaperDtl::find()->where(['epaper_id' => $row['id'],'page_id' => $key])->one();
---
SELECT * FROM `tbl_pap_epaper_dtl` WHERE (`epaper_id`=269) AND (`page_id`=0)